# Robbie Tovar
## Week 13: 11/14/23
### python - pandas dataframe - mapping, applying,  grouping, plotting

In [1]:
import numpy as np
from pandas import *
import pandas as pd

In [2]:
df = DataFrame({'City':['Alma', 'Brian Head','Fox Park', 'Lake Mary'], 'Altitude': [10335, 9800,9062, 8966]})
df

         City  Altitude
0        Alma     10335
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map = {'Alma':'Colorado', 'Brain Head' : 'Utah', 'Fox Park':'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brain Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
#map()
df['State'] = df['City'].map(st_map)
df

         City  Altitude       State
0        Alma     10335    Colorado
1  Brian Head      9800         NaN
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [5]:
#apply
df1 = df.copy()
def meter(x):
    return x/3.2808

In [6]:
df['Altitude'] = df['Altitude'].apply(meter)
df

         City     Altitude       State
0        Alma  3150.146306    Colorado
1  Brian Head  2987.076323         NaN
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [7]:
df1['Altitude'] = df1['Altitude'].apply(lambda x: x/3.2808)
df1

         City     Altitude       State
0        Alma  3150.146306    Colorado
1  Brian Head  2987.076323         NaN
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [8]:
df['Altitude'] = df['Altitude'].apply(lambda x: np.nan if x < 2800 else x)
df

         City     Altitude       State
0        Alma  3150.146306    Colorado
1  Brian Head  2987.076323         NaN
2    Fox Park          NaN     Wyoming
3   Lake Mary          NaN  California

In [11]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
               index = ['UT','OH','TX','OR'])
df

           b         d         e
UT -0.678330  2.850684 -2.159775
OH -1.351205 -0.351816 -0.010954
TX -0.822722 -0.363100  0.347690
OR -0.026206  0.875206 -0.629229

In [12]:
def dif(x):
    return x.max()-x.min()

In [13]:
df.apply(dif)

b    1.324999
d    3.213783
e    2.507465
dtype: float64

In [16]:
df.apply(lambda x:x.max() -x.min())

b    1.324999
d    3.213783
e    2.507465
dtype: float64

In [19]:
df.apply(lambda x:x.max() -x.min(), axis=1)

UT    5.010459
OH    1.340250
TX    1.170412
OR    1.504435
dtype: float64

In [20]:
df.apply(pd.value_counts)

             b    d    e
-2.159775  NaN  NaN  1.0
-1.351205  1.0  NaN  NaN
-0.822722  1.0  NaN  NaN
-0.678330  1.0  NaN  NaN
-0.629229  NaN  NaN  1.0
-0.363100  NaN  1.0  NaN
-0.351816  NaN  1.0  NaN
-0.026206  1.0  NaN  NaN
-0.010954  NaN  NaN  1.0
 0.347690  NaN  NaN  1.0
 0.875206  NaN  1.0  NaN
 2.850684  NaN  1.0  NaN

In [21]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-2.159775  0.0  0.0  1.0
-1.351205  1.0  0.0  0.0
-0.822722  1.0  0.0  0.0
-0.678330  1.0  0.0  0.0
-0.629229  0.0  0.0  1.0
-0.363100  0.0  1.0  0.0
-0.351816  0.0  1.0  0.0
-0.026206  1.0  0.0  0.0
-0.010954  0.0  0.0  1.0
 0.347690  0.0  0.0  1.0
 0.875206  0.0  1.0  0.0
 2.850684  0.0  1.0  0.0

In [22]:
df.apply(value_counts).fillna(0).astype(int)

           b  d  e
-2.159775  0  0  1
-1.351205  1  0  0
-0.822722  1  0  0
-0.678330  1  0  0
-0.629229  0  0  1
-0.363100  0  1  0
-0.351816  0  1  0
-0.026206  1  0  0
-0.010954  0  0  1
 0.347690  0  0  1
 0.875206  0  1  0
 2.850684  0  1  0

In [23]:
df.apply(pd.value_counts, axis=1).fillna(0).astype(int)

,-2.159775,-1.351205,-0.822722,-0.678330,-0.629229,-0.363100,-0.351816,-0.026206,-0.010954,0.347690,0.875206,2.850684
UT,1,0,0,1,0,0,0,0,0,0,0,1
OH,0,1,0,0,0,0,1,0,1,0,0,0
TX,0,0,1,0,0,1,0,0,0,1,0,0
OR,0,0,0,0,1,0,0,1,0,0,1,0

In [24]:
# group by, the most prequently used panda function in data analysis. grouping data points based on distinct values 
#in teh given column or columns
cars = ['Toyota', 'Ford', 'GMC','Dodge', 'BMW']

df = DataFrame({'brand':np.random.choice(cars, size=20),
                'price' :np.random.randint(40000,65000, size=20)})
df

     brand  price
0      GMC  56339
1   Toyota  53017
2      BMW  52769
3   Toyota  57594
4     Ford  57532
5      BMW  64113
6     Ford  59224
7    Dodge  56177
8     Ford  56828
9      BMW  61384
10     BMW  64229
11  Toyota  51594
12     BMW  64005
13     BMW  52200
14    Ford  45849
15  Toyota  64695
16     BMW  51328
17     BMW  64380
18     GMC  46948
19  Toyota  50032

In [25]:
df.groupby('brand').sum()

         price
brand
BMW     474408
Dodge    56177
Ford    219433
GMC     103287
Toyota  276932

In [26]:
df.groupby('brand').count()

        price
brand
BMW         8
Dodge       1
Ford        4
GMC         2
Toyota      5

In [27]:
df.groupby('brand')['price'].mean()

brand
BMW       59301.00
Dodge     56177.00
Ford      54858.25
GMC       51643.50
Toyota    55386.40
Name: price, dtype: float64

In [28]:
df['price'].groupby(df['brand']).sum()

brand
BMW       474408
Dodge      56177
Ford      219433
GMC       103287
Toyota    276932
Name: price, dtype: int32

In [29]:
type(df['price'].groupby(df['brand']).sum())

pandas.core.series.Series

In [33]:
type(df.groupby(df['brand']).mean())

pandas.core.frame.DataFrame

In [36]:
df['cum_sum'] = df.groupby('brand')['price'].cumsum()
df

     brand  price  cum_sum
0      GMC  56339    56339
1   Toyota  53017    53017
2      BMW  52769    52769
3   Toyota  57594   110611
4     Ford  57532    57532
5      BMW  64113   116882
6     Ford  59224   116756
7    Dodge  56177    56177
8     Ford  56828   173584
9      BMW  61384   178266
10     BMW  64229   242495
11  Toyota  51594   162205
12     BMW  64005   306500
13     BMW  52200   358700
14    Ford  45849   219433
15  Toyota  64695   226900
16     BMW  51328   410028
17     BMW  64380   474408
18     GMC  46948   103287
19  Toyota  50032   276932

In [37]:
df.sort_values(by='brand')

     brand  price  cum_sum
9      BMW  61384   178266
17     BMW  64380   474408
2      BMW  52769    52769
16     BMW  51328   410028
5      BMW  64113   116882
10     BMW  64229   242495
13     BMW  52200   358700
12     BMW  64005   306500
7    Dodge  56177    56177
4     Ford  57532    57532
6     Ford  59224   116756
8     Ford  56828   173584
14    Ford  45849   219433
0      GMC  56339    56339
18     GMC  46948   103287
15  Toyota  64695   226900
3   Toyota  57594   110611
1   Toyota  53017    53017
11  Toyota  51594   162205
19  Toyota  50032   276932

In [40]:
#group by using two columns
sample1= list('abcd')
sample2=['one','two','three','four']

df= DataFrame({
    'k1':np.random.choice(sample1,size=40),
    'k2':np.random.choice(sample2,size=40),
    'dataset1': np.random.randn(40)*10,
    'dataset2': np.random.randn(40)*10,
})
df

   k1     k2   dataset1   dataset2
0   a    one   8.434710  -5.240680
1   d  three   1.016280 -16.932968
2   c    one -27.558295   1.055056
3   d  three -11.990986  -8.965189
4   d  three  -8.009494 -14.134499
5   d    one  28.618646  -0.472352
6   b   four -11.056317  10.305011
7   b   four  -7.621423  -6.744376
8   a  three -20.997202  -1.483419
9   d    two   9.517037  -7.985960
10  d   four -18.930548   6.505543
11  a    one   7.762099  -4.336296
12  d    two -19.066268  12.389625
13  a    one   3.098004  15.097845
14  d   four  19.000135   4.997727
15  c    one -13.632170   5.871426
16  d    two  13.720875   6.840878
17  c    one   1.195627  -8.820344
18  c  three  -4.383682   2.788409
19  c  three   7.026590 -11.532572
20  c  three -11.129783  -2.577709
21  c  three  -3.652284   0.992273
22  c   four   3.724257  -1.157122
23  b    one   0.359573  -6.978509
24  c    one -15.695300 -11.992579
25  c    one   9.171268  -7.364730
26  c  three -17.008536   1.088010
27  b    one  -7.357831   2.190745
28  b   four  -4.004138  -5.082055
29  a  three  -9.131933  11.184527
30  d   four  -9.336994  -7.272868
31  d   four  -0.423329 -12.239437
32  b    two  10.733634  -8.046188
33  b    one -14.467767   2.369777
34  a  three  -3.001607  -8.670442
35  b    one -15.696860 -10.949005
36  b    two  -9.756439 -17.640013
37  c    two  13.730666   5.357738
38  c   four   9.832653   3.453237
39  c   four -12.329351 -17.735894

In [41]:
df.groupby('k1').sum()

     dataset1   dataset2
k1
a  -13.835928   6.551535
b  -58.867566 -40.574611
c  -60.708342 -40.574802
d    4.115352 -37.269501

In [42]:
df.groupby('k2').sum()

        dataset1   dataset2
k2
four  -31.145056 -24.970234
one   -35.768294 -29.569644
three -81.262638 -48.243580
two    18.879504  -9.083921

In [43]:
df.groupby(['k1','k2']).sum()

           dataset1   dataset2
k1 k2
a  one    19.294814   5.520870
   three -33.130742   1.030665
b  four  -22.681878  -1.521419
   one   -37.162884 -13.366991
   two     0.977195 -25.686201
c  four    1.227558 -15.439779
   one   -46.518870 -21.251172
   three -29.147696  -9.241589
   two    13.730666   5.357738
d  four   -9.690737  -8.009036
   one    28.618646  -0.472352
   three -18.984201 -40.032656
   two     4.171643  11.244543

In [44]:
df['dataset1'].groupby(df['k1']).sum()

k1
a   -13.835928
b   -58.867566
c   -60.708342
d     4.115352
Name: dataset1, dtype: float64

In [45]:
df.groupby(['k1','k2'])[['dataset1']].sum()

           dataset1
k1 k2
a  one    19.294814
   three -33.130742
b  four  -22.681878
   one   -37.162884
   two     0.977195
c  four    1.227558
   one   -46.518870
   three -29.147696
   two    13.730666
d  four   -9.690737
   one    28.618646
   three -18.984201
   two     4.171643

In [46]:
group1 =df.groupby(['k1','k2'])[['dataset1']]
group1

In [47]:
group1.mean()

           dataset1
k1 k2
a  one     6.431605
   three -11.043581
b  four   -7.560626
   one    -9.290721
   two     0.488597
c  four    0.409186
   one    -9.303774
   three  -5.829539
   two    13.730666
d  four   -2.422684
   one    28.618646
   three  -6.328067
   two     1.390548

In [48]:
group1.cumsum()

     dataset1
0    8.434710
1    1.016280
2  -27.558295
3  -10.974706
4  -18.984201
5   28.618646
6  -11.056317
7  -18.677740
8  -20.997202
9    9.517037
10 -18.930548
11  16.196810
12  -9.549231
13  19.294814
14   0.069587
15 -41.190465
16   4.171643
17 -39.994838
18  -4.383682
19   2.642907
20  -8.486876
21 -12.139160
22   3.724257
23   0.359573
24 -55.690138
25 -46.518870
26 -29.147696
27  -6.998257
28 -22.681878
29 -30.129135
30  -9.267408
31  -9.690737
32  10.733634
33 -21.466024
34 -33.130742
35 -37.162884
36   0.977195
37  13.730666
38  13.556909
39   1.227558